In [1]:
import pandas as pd

In [7]:
df = pd.read_csv("arquivo.csv", sep=';')

In [10]:
df.head(10)

               Team               Player      Salary       Position
0  New York Yankees        Acevedo, Juan         900        Pitcher
1  New York Yankees      Anderson, Jason         300        Pitcher
2  New York Yankees       Clemens, Roger  10,100,000        Pitcher
3  New York Yankees      Contreras, Jose   5,500,000        Pitcher
4  New York Yankees       Flaherty, John         750        Catcher
5  New York Yankees        Giambi, Jason  11,428,571  First Baseman
6  New York Yankees       Hammond, Chris   2,200,000        Pitcher
7  New York Yankees  Hitchcock, Sterling   6,000,000        Pitcher
8  New York Yankees         Jeter, Derek  15,600,000      Shortstop
9  New York Yankees        Johnson, Nick       364,1  First Baseman

In [11]:
df.shape

(381, 4)

In [12]:
df.columns

Index(['Team', 'Player', 'Salary', 'Position'], dtype='object')

In [13]:
df.dtypes

Team        object
Player      object
Salary      object
Position    object
dtype: object

In [14]:
Team_df = df["Team"]
Team_df.head()

0    New York Yankees
1    New York Yankees
2    New York Yankees
3    New York Yankees
4    New York Yankees
Name: Team, dtype: object

In [15]:
df.tail(5)

              Team            Player     Salary   Position
376  Texas Rangers    Valdes, Ismael  2,500,000    Pitcher
377  Texas Rangers  Van Poppel, Todd  2,500,000    Pitcher
378  Texas Rangers      Yan, Esteban  1,500,000    Pitcher
379  Texas Rangers     Young, Mike B        415  Shortstop
380  Texas Rangers   Zimmerman, Jeff  3,366,667    Pitcher

In [16]:
df.describe()

                     Team      Player Salary Position
count                 381         381    381      381
unique                 14         381    172        7
top     Cleveland Indians  Paul, Josh    300  Pitcher
freq                   31           1     44      180

In [24]:
Team_df = df.loc[df["Team"]=="Cleveland Indians"]
Team_df.head()

                 Team           Player     Salary       Position
82  Cleveland Indians  Anderson, Brian  1,500,000        Pitcher
83  Cleveland Indians      Baez, Danys  5,125,000        Pitcher
84  Cleveland Indians       Bard, Josh      302,1        Catcher
85  Cleveland Indians      Bere, Jason  1,000,000        Pitcher
86  Cleveland Indians     Blake, Casey        330  Third Baseman

In [31]:
df.groupby("Team")["Player"].nunique()

Team
Anaheim Angels          27
Baltimore Orioles       29
Boston Red Sox          27
Chicago White Sox       26
Cleveland Indians       31
Detroit Tigers          26
Kansas City Royals      26
Minnesota Twins         26
New York Yankees        28
Oakland Athletics       26
Seattle Mariners        27
Tampa Bay Devil Rays    25
Texas Rangers           30
Toronto Blue Jays       27
Name: Player, dtype: int64

In [2]:
s = pd.Series("Team")

In [3]:
s

0    Team
dtype: object